InformationRegisters/Варианты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Варианты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Число1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ТестНаСервере()
	Если Варианты.НайтиСтроки(Новый Структура("Вариант", Цифра1 + Цифра2 + Цифра3 + Цифра4)).Количество() = 0 Тогда
		ЗаполнитьЗначенияСвойств(Варианты.Добавить(), Новый Структура("Вариант,Б,К,Цифра1,Цифра2,Цифра3,Цифра4", Цифра1 + Цифра2 + Цифра3 + Цифра4, КоличествоБыков, КоличествоКоров, Цифра1, Цифра2, Цифра3, Цифра4));
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВВ.Вариант КАК Вариант,
		                      |	ВВ.Число1 КАК Число1,
		                      |	ВВ.Число2 КАК Число2,
		                      |	ВВ.Число3 КАК Число3,
		                      |	ВВ.Число4 КАК Число4
		                      |ИЗ
		                      |	РегистрСведений.Варианты КАК ВВ");
		ПетрПервый	= Истина;
		Текст = "
			|
			|	ГДЕ
			|	";
		Было		= Новый Массив;
		БыкиИКоровы	= 0;
		НомерСтроки	= 0;
		Для Каждого ТекСтрока Из Варианты Цикл
			НомерСтроки	= НомерСтроки + 1;
			Если ТекСтрока.Б + ТекСтрока.К = 0 Тогда
				Если НЕ ПетрПервый Тогда
					Текст = Текст + "
						|	И ";
				КонецЕсли;
				ПетрПервый	= Ложь;
				Текст = Текст + "((ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"") = ЛОЖЬ)";
				//Текст = Текст + "((ВВ.Вариант ПОДОБНО ""%Цифра1%"") = ЛОЖЬ ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра2%"") = ЛОЖЬ ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра3%"") = ЛОЖЬ И (ВВ.Вариант ПОДОБНО ""%Цифра4%"") = ЛОЖЬ)";
			Иначе
				Если ТекСтрока.Б > 0 Тогда
					Если НЕ ПетрПервый Тогда
						Текст = Текст + "
							|	И ";
					КонецЕсли;
					Если ТекСтрока.Б = 1 Тогда
						Текст = Текст + "(ВВ.Число1 = Цифра1 ИЛИ ВВ.Число2 = Цифра2 ИЛИ ВВ.Число3 = Цифра3 ИЛИ ВВ.Число4 = Цифра4)";
					ИначеЕсли ТекСтрока.Б = 2 Тогда
						Текст = Текст + "((ВВ.Число1 = Цифра1 И ВВ.Число2 = Цифра2) ИЛИ (ВВ.Число1 = Цифра1 И ВВ.Число3 = Цифра3) ИЛИ (ВВ.Число1 = Цифра1 И ВВ.Число4 = Цифра4)
	                      |	ИЛИ (ВВ.Число2 = Цифра2 И ВВ.Число3 = Цифра3) ИЛИ (ВВ.Число2 = Цифра2 И ВВ.Число4 = Цифра4)
	                      |	ИЛИ (ВВ.Число3 = Цифра3 И ВВ.Число4 = Цифра4))";
					Иначе	//	3
						Текст = Текст + "((ВВ.Число1 = Цифра1 И ВВ.Число2 = Цифра2 И ВВ.Число3 = Цифра3) ИЛИ (ВВ.Число1 = Цифра1 И ВВ.Число2 = Цифра2 И ВВ.Число4 = Цифра4)
	                      |	ИЛИ (ВВ.Число2 = Цифра2 ИЛИ ВВ.Число3 = Цифра3 ИЛИ ВВ.Число4 = Цифра4))";
					КонецЕсли;
					Если ТекСтрока.К = 0 Тогда
						Текст = Текст + "
						|	И ((ВВ.Вариант ПОДОБНО ""%Цифра1%"") = ЛОЖЬ ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра2%"") = ЛОЖЬ ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра3%"") = ЛОЖЬ И (ВВ.Вариант ПОДОБНО ""%Цифра4%"") = ЛОЖЬ)";
					КонецЕсли;
					ПетрПервый	= Ложь;
				КонецЕсли;
				Если ТекСтрока.К > 0 Тогда
					Если НЕ ПетрПервый Тогда
						Текст = Текст + "
							|	И ";
					КонецЕсли;
					Если ТекСтрока.К = 1 Тогда
						Текст = Текст + "(ВВ.Вариант ПОДОБНО ""%Цифра1%"" ИЛИ ВВ.Вариант ПОДОБНО ""%Цифра2%"" ИЛИ ВВ.Вариант ПОДОБНО ""%Цифра3%"" ИЛИ ВВ.Вариант ПОДОБНО ""%Цифра4%"")";
					ИначеЕсли ТекСтрока.К = 2 Тогда
						Текст = Текст + "(((ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра2%"") ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"") ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"")
	                  		| ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"") ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"")
	                 		| ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра3%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"")))";
					ИначеЕсли ТекСтрока.К = 3 Тогда
						Текст = Текст + "((ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"") ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"")
	                      |	ИЛИ (ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%""))";
					Иначе
						Текст = Текст + "(ВВ.Вариант ПОДОБНО ""%Цифра1%"" И ВВ.Вариант ПОДОБНО ""%Цифра2%"" И ВВ.Вариант ПОДОБНО ""%Цифра3%"" И ВВ.Вариант ПОДОБНО ""%Цифра4%"")";
					КонецЕсли;
					Если ТекСтрока.Б = 0 Тогда
						Текст = Текст + "
							|	И ВВ.Число1 <> Цифра1 И ВВ.Число2 <> Цифра2 И ВВ.Число3 <> Цифра3 И ВВ.Число4 <> Цифра4";
					КонецЕсли;
					ПетрПервый	= Ложь;
				КонецЕсли;
			КонецЕсли;
			Текст	= СтрЗаменить(Текст, "Цифра1",	ТекСтрока.Цифра1);
			Текст	= СтрЗаменить(Текст, "Цифра2",	ТекСтрока.Цифра2);
			Текст	= СтрЗаменить(Текст, "Цифра3",	ТекСтрока.Цифра3);
			Текст	= СтрЗаменить(Текст, "Цифра4",	ТекСтрока.Цифра4);
			
			БыкиИКоровы	= БыкиИКоровы + ТекСтрока.Б + ТекСтрока.К;
			Было.Добавить(ТекСтрока.Вариант);
			
			Если НомерСтроки = 2 И БыкиИКоровы >= 3 Тогда
				Виктим	= "";
				Слово	= Было.Получить(0) + Было.Получить(1);
				Для Буква = 1 По 8 Цикл
					Если СтрЧислоВхождений(Слово, Сред(Слово, Буква, 1)) > 1 Тогда
						Виктим	= Сред(Слово, Буква, 1);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ПустаяСтрока(Виктим) Тогда
					Для Буква = 1 По 9 Цикл
						Если СтрЧислоВхождений(Слово, Формат(Буква, "ЧГ=0")) = 0 Тогда
							Текст	= Текст + "
							| И (ВВ.Вариант ПОДОБНО ""%" + Формат(Буква, "ЧГ=0") + "%"")" + ?(БыкиИКоровы=4, " = ЛОЖЬ", "");
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Запрос.УстановитьПараметр("Варианты",	Было);
		
		ТекстЗапроса	= Запрос.Текст + Текст + ?(НеНоль, "
			| И (ВВ.Вариант ПОДОБНО ""%0%"") = ЛОЖЬ", "") + "
			| И ВВ.Вариант В(&Варианты) = ЛОЖЬ";
		Если Ответы.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("Ответы",	Ответы.Выгрузить().ВыгрузитьКолонку("Вариант"));
			ТекстЗапроса	= Запрос.Текст + Текст + "
			| И ВВ.Вариант В(&Ответы)
			| И ВВ.Вариант В(&Варианты) = ЛОЖЬ";
		КонецЕсли;
		Запрос.Текст	= ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();

		Итоги.Очистить();
		Ответы.Очистить();
		Пока Выборка.Следующий() Цикл
			Если Ответы.Количество() < 22 Тогда
				Ответ	= Выборка.Вариант;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Ответы.Добавить(), Выборка);
			
			//Если Итоги.НайтиСтроки(Новый Структура("Номер", Строка(Выборка.Число1))).Количество() = 0 Тогда
			//	ЗаполнитьЗначенияСвойств(Итоги.Добавить(), Новый Структура("Номер", Выборка.Число1));
			//КонецЕсли;
			//Если Итоги.НайтиСтроки(Новый Структура("Номер", Строка(Выборка.Число2))).Количество() = 0 Тогда
			//	ЗаполнитьЗначенияСвойств(Итоги.Добавить(), Новый Структура("Номер", Выборка.Число2));
			//КонецЕсли;
			//Если Итоги.НайтиСтроки(Новый Структура("Номер", Строка(Выборка.Число3))).Количество() = 0 Тогда
			//	ЗаполнитьЗначенияСвойств(Итоги.Добавить(), Новый Структура("Номер", Выборка.Число3));
			//КонецЕсли;
			//Если Итоги.НайтиСтроки(Новый Структура("Номер", Строка(Выборка.Число4))).Количество() = 0 Тогда
			//	ЗаполнитьЗначенияСвойств(Итоги.Добавить(), Новый Структура("Номер", Выборка.Число4));
			//КонецЕсли;
		КонецЦикла;
		ТекСтрока.КоличествоВариантов	= Ответы.Количество();
		
		Если Варианты.Количество() > 1 Тогда
			Для Каждого ТекСтрока Из Ответы Цикл
				Для Каждого Вариант Из Варианты Цикл
					Если СтрНайти(Вариант.Вариант, ТекСтрока.Число1) > 0 Тогда
						ТекСтрока.Коэффициент = ТекСтрока.Коэффициент + Коэффициент(Вариант.Б, Вариант.К);
					КонецЕсли;
					Если СтрНайти(Вариант.Вариант, ТекСтрока.Число2) > 0 Тогда
						ТекСтрока.Коэффициент = ТекСтрока.Коэффициент + Коэффициент(Вариант.Б, Вариант.К);
					КонецЕсли;
					Если СтрНайти(Вариант.Вариант, ТекСтрока.Число3) > 0 Тогда
						ТекСтрока.Коэффициент = ТекСтрока.Коэффициент + Коэффициент(Вариант.Б, Вариант.К);
					КонецЕсли;
					Если СтрНайти(Вариант.Вариант, ТекСтрока.Число4) > 0 Тогда
						ТекСтрока.Коэффициент = ТекСтрока.Коэффициент + Коэффициент(Вариант.Б, Вариант.К);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Ответы.Сортировать("Коэффициент УБЫВ");
			
			//Для Каждого ТекСтрока Из Итоги Цикл
			//	Для Каждого Вариант Из Варианты Цикл
			//		Если СтрНайти(Вариант.Вариант, ТекСтрока.Номер) > 0 Тогда
			//			Если Вариант.Б = 0 И Вариант.К = 0 Тогда
			//				ТекСтрока.Коэффициент = ТекСтрока.Коэффициент - 100;
			//			Иначе
			//				ТекСтрока.Коэффициент = ТекСтрока.Коэффициент + ?(Вариант.Б=0, 0, 10) + ?(Вариант.К=0, 0, 1);
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЦикла;
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	ВВ.Вариант КАК Вариант,
			//               |	ВВ.Число1 КАК Число1,
			//               |	ВВ.Число2 КАК Число2,
			//               |	ВВ.Число3 КАК Число3,
			//               |	ВВ.Число4 КАК Число4
			//               |ПОМЕСТИТЬ ВТ
			//               |ИЗ
			//               |	&ВТ КАК ВВ
			//               |;
			//               |
			//               |////////////////////////////////////////////////////////////////////////////////
			//               |ВЫБРАТЬ
			//               |	Номера.Номер КАК Номер,
			//               |	Номера.Коэффициент КАК Коэффициент
			//               |ПОМЕСТИТЬ Номера
			//               |ИЗ
			//               |	&Номера КАК Номера
			//               |;
			//               |
			//               |////////////////////////////////////////////////////////////////////////////////
			//               |ВЫБРАТЬ
			//               |	ВВ.Вариант КАК Вариант,
			//               |	СУММА(Номера.Коэффициент) КАК Коэффициент
			//               |ИЗ
			//               |	ВТ КАК ВВ
			//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Номера КАК Номера
			//               |		ПО (Номера.Номер = ВВ.Число1
			//               |				ИЛИ Номера.Номер = ВВ.Число2
			//               |				ИЛИ Номера.Номер = ВВ.Число3
			//               |				ИЛИ Номера.Номер = ВВ.Число4)
			//               |
			//               |СГРУППИРОВАТЬ ПО
			//               |	ВВ.Вариант
			//               |
			//               |УПОРЯДОЧИТЬ ПО
			//               |	Коэффициент УБЫВ";
			//Запрос.УстановитьПараметр("Номера",	Итоги.Выгрузить());
			//Запрос.УстановитьПараметр("ВТ",		Ответы.Выгрузить());
			//Выборка = Запрос.Выполнить().Выгрузить().Выбрать();
			//Ответ	= "";
			//Если Выборка.Следующий() Тогда
			//	Ответ	= Выборка.Вариант;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Коэффициент(Б, К)
	Если Б = 0 И К = 0 Тогда
		Возврат - 100;
	КонецЕсли;
	Возврат ?(Б=0, 0, 10) + ?(К=0, 0, 1);
КонецФункции

&НаКлиенте
Процедура Тест(Команда)
	Если ПроверитьЗаполнение() Тогда
		Слово	= Цифра1 + Цифра2 + Цифра3 + Цифра4;
		Если СтрЧислоВхождений(Слово, Цифра1) + СтрЧислоВхождений(Слово, Цифра2) + СтрЧислоВхождений(Слово, Цифра3) + СтрЧислоВхождений(Слово, Цифра4) = 4 Тогда
			ТестНаСервере();
			
			Элементы.НеНоль.Доступность	= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Варианты.Очистить();
	Ответы.Очистить();
	
	Элементы.НеНоль.Доступность	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтветыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Цифра1	= Лев(Элемент.ТекущиеДанные.Вариант, 1);
		Цифра2	= Сред(Элемент.ТекущиеДанные.Вариант, 2);
		Цифра3	= Сред(Элемент.ТекущиеДанные.Вариант, 3);
		Цифра4	= Сред(Элемент.ТекущиеДанные.Вариант, 4);
	КонецЕсли;
КонецПроцедуры
